app/views/photo/user_photos.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
      <td><%=photo.created_at%></td>
      <td><%=Comment.find(photo.id).comment_text%></td>
      <%= comment_user = User.find(Comment.find(photo.id).user_id) %>